Revit 2024 API
ParameterTypeId.SteelElemWeldMainSurfaceshape Property
 "Surface Shape"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId SteelElemWeldMainSurfaceshape { get; }
Visual Basic
Public Shared ReadOnly Property SteelElemWeldMainSurfaceshape As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SteelElemWeldMainSurfaceshape {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace